Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/base_station/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# BLE / NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# #505: at INFO, NimBLE emits three lines per telemetry notify (~2/s for the whole
# session) — "GATT procedure initiated: notify; att_handle=16". In a 96 s bench run
# that was the overwhelming majority of the console and it buried the BS's own
# [RX]/[STATS]/[UPLINK]/[BATT] lines, which are the ones you actually watch during
# a flight. Also costs CPU + UART bandwidth on the hot notify path.
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# Power management (base station is battery-powered)
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_BT_NIMBLE_SLEEP_ENABLE=y
CONFIG_ESP_PHY_MAC_BB_PD=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: new images boot as PENDING_VERIFY and auto-roll back to ota_0
# unless app calls esp_ota_mark_app_valid_cancel_rollback() after first
# successful telemetry round-trip. See docs/plans/08-ota-firmware-update.md §4.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# FAT filesystem — enable long filenames (required for timestamped CSV logs)
CONFIG_FATFS_LFN_HEAP=y
